DSU/src/Documents/ПлановыеДоходыРасходы/ПлановыеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлановыеДоходыРасходы</name>
  <registerRecords>InformationRegister.ГрафикПлановыхДоходовРасходов</registerRecords>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/Documents/ПлановыеДоходыРасходы/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьФорматПлановойДатыНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПланированияПриИзменении(Элемент)
	
	ИзменитьФорматПлановойДатыНаСервере();
		
КонецПроцедуры

Процедура ИзменитьФорматПлановойДатыНаСервере()

	Если Объект.ПериодПланирования = 0 Тогда // однократно
		
		Элементы.ДатаПланирования.Видимость = Истина;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM.yyyy";
		Элементы.ДатаПланирования.Заголовок = "Дата";
		Элементы.ДатаНачала.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.НомерДня.Видимость = Ложь;
		
	ИначеЕсли Объект.ПериодПланирования = 1 Тогда // еженедельно	
		
		Элементы.ДатаПланирования.Видимость = Ложь;
		//Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM.yyyy";
		//Элементы.ДатаПланирования.Заголовок = "Дата расхода";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Истина;
		Элементы.НомерДня.Заголовок = "День недели";
		
	ИначеЕсли Объект.ПериодПланирования = 2 Тогда // ежемесячно	
		
		Элементы.ДатаПланирования.Видимость = Ложь;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd";
		Элементы.ДатаПланирования.Заголовок = "Число месяца";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Истина;
		Элементы.НомерДня.Заголовок = "Число месяца";
		
	ИначеЕсли Объект.ПериодПланирования = 3 Тогда // ежегодно
		
		Элементы.ДатаПланирования.Видимость = Истина;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM";
		Элементы.ДатаПланирования.Заголовок = "День года";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Ложь;
	
	КонецЕсли; 

КонецПроцедуры
